//
//  2D-Array-D.swift
//  CT02
//
//  Created by Bran on 11/25/25.
//

import Foundation

/*
Q3.
 10×10 크기의 격자판이 있습니다.
 초기 상태는 모든 칸이 하얀색(0)으로 칠해져 있습니다.

 격자판의 특정 칸을 클릭하면, 그 칸과 상하좌우 인접한 칸이 검은색(1)으로 칠해지도록 구현하세요.

 단, 이미 칠해진 칸을 다시 클릭하면 색이 유지됩니다. (즉, 검은색은 덮어씌워져도 그대로 검은색입니다)
 또 격자 밖의 칸은 존재하지 않으므로 무시됩니다.

 * 입출력 예시
 [입력]
 2 2

 [출력]
 0 0 0 0 0 0 0 0 0 0
 0 0 1 0 0 0 0 0 0 0
 0 1 1 1 0 0 0 0 0 0
 0 0 1 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0
 */
func q3() {
  var board = [
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  ]
}


/// https://school.programmers.co.kr/learn/courses/30/lessons/120866
func p120866(_ board: [[Int]]) -> Int {
  0
}


/// https://school.programmers.co.kr/learn/courses/30/lessons/181832
func p18132(_n : Int) -> [[Int]] {
  []
}
